app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("primeiroNome", "ultimoNome", "isPessoaFisica", "dataNascimento", "documento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"